In [9]:
import pandas as pd

In [10]:
n1=pd.Series([1,2,3,34,5,6,6,2])
n1

0     1
1     2
2     3
3    34
4     5
5     6
6     6
7     2
dtype: int64

In [11]:
type(n1)

pandas.core.series.Series

In [12]:
n1=pd.Series([1,2,3,34,5,6,6,2],index=[1,2,34,5,67,7,3,5])
n1

1      1
2      2
34     3
5     34
67     5
7      6
3      6
5      2
dtype: int64

n1 = pd.Series

In [13]:
n1=pd.Series({"a":10,"b":20,"c":30})
n1

a    10
b    20
c    30
dtype: int64

In [14]:
n1=pd.Series({"a":10,"b":20,"c":30},index=["a","c","f","b"])

In [15]:
n1

a    10.0
c    30.0
f     NaN
b    20.0
dtype: float64

In [16]:
s1=pd.Series([1,3,5,67,7])

In [17]:
s1+5

0     6
1     8
2    10
3    72
4    12
dtype: int64

In [18]:
s2=pd.Series([6,8,9,200,27])

In [19]:
s1+s2

0      7
1     11
2     14
3    267
4     34
dtype: int64

In [20]:
s3=pd.Series([1,3,4,2,34,1,4,2,4,2,3,24,1])

In [21]:
s1+s3

0      2.0
1      6.0
2      9.0
3     69.0
4     41.0
5      NaN
6      NaN
7      NaN
8      NaN
9      NaN
10     NaN
11     NaN
12     NaN
dtype: float64

In [22]:
s3+s1

0      2.0
1      6.0
2      9.0
3     69.0
4     41.0
5      NaN
6      NaN
7      NaN
8      NaN
9      NaN
10     NaN
11     NaN
12     NaN
dtype: float64

In [24]:
import pandas as pd
df=pd.DataFrame({"name":['a','b','c','d','e','f','h'],"mark":[1,2,3,3,45,6,7]})

In [25]:
df

  name  mark
0    a     1
1    b     2
2    c     3
3    d     3
4    e    45
5    f     6
6    h     7

In [26]:
df.head()

  name  mark
0    a     1
1    b     2
2    c     3
3    d     3
4    e    45

In [27]:
df.tail()

  name  mark
2    c     3
3    d     3
4    e    45
5    f     6
6    h     7

In [29]:
df.shape

(7, 2)

In [30]:
df.describe()

            mark
count   7.000000
mean    9.571429
std    15.767658
min     1.000000
25%     2.500000
50%     3.000000
75%     6.500000
max    45.000000

In [31]:
import pandas as pd
df=pd.DataFrame({"name":['a','b','c','d','e','f','g'],"mark":[10,20,30,40,50,60,70]})

In [32]:
df

  name  mark
0    a    10
1    b    20
2    c    30
3    d    40
4    e    50
5    f    60
6    g    70

In [33]:
df.head()

  name  mark
0    a    10
1    b    20
2    c    30
3    d    40
4    e    50

In [34]:
df.tail()

  name  mark
2    c    30
3    d    40
4    e    50
5    f    60
6    g    70

In [35]:
df.shape

(7, 2)

In [36]:
df.describe()

            mark
count   7.000000
mean   40.000000
std    21.602469
min    10.000000
25%    25.000000
50%    40.000000
75%    55.000000
max    70.000000

In [1]:
import pandas as pd

In [2]:
s1=pd.Series([1,2,3,42,1,1,23,1,1,2])
s1

0     1
1     2
2     3
3    42
4     1
5     1
6    23
7     1
8     1
9     2
dtype: int64

In [3]:
type(s1)

pandas.core.series.Series

In [6]:
s1=pd.Series(["se","da","fa"],index=[3,2,6])
s1

3    se
2    da
6    fa
dtype: object

In [10]:
d1=pd.Series({"s":2,"sw":21,"sq":22})

In [11]:
d1

s      2
sw    21
sq    22
dtype: int64

In [12]:
s1[3]

'se'

In [13]:
s1[1]

KeyError: 1

In [14]:
s1=pd.Series([1,2,3,42,1,1,23,1,1,2])
s1

0     1
1     2
2     3
3    42
4     1
5     1
6    23
7     1
8     1
9     2
dtype: int64

In [15]:
s2=pd.Series([1,2,3,42,1,1,23,1,1,2,2,3,1,1,3,1])
s2

0      1
1      2
2      3
3     42
4      1
5      1
6     23
7      1
8      1
9      2
10     2
11     3
12     1
13     1
14     3
15     1
dtype: int64

In [16]:
s1+s2

0      2.0
1      4.0
2      6.0
3     84.0
4      2.0
5      2.0
6     46.0
7      2.0
8      2.0
9      4.0
10     NaN
11     NaN
12     NaN
13     NaN
14     NaN
15     NaN
dtype: float64

In [17]:
Df=pf.DataFrame({"name":["A","B","c","d","e","f","g"],"mark":[1,2,1,2,1,2,1,2]})

NameError: name 'pf' is not defined

In [19]:
Df=pd.DataFrame({"name":["A","B","c","d","e","f","g"],"mark":[1,2,1,2,1,2,1]})

In [20]:
Df

  name  mark
0    A     1
1    B     2
2    c     1
3    d     2
4    e     1
5    f     2
6    g     1

In [21]:
type(Df)

pandas.core.frame.DataFrame

In [22]:
Df.head()

  name  mark
0    A     1
1    B     2
2    c     1
3    d     2
4    e     1

In [23]:
Df.tail()

  name  mark
2    c     1
3    d     2
4    e     1
5    f     2
6    g     1

In [24]:
Df.shape

(7, 2)

In [25]:
Df.describe()

           mark
count  7.000000
mean   1.428571
std    0.534522
min    1.000000
25%    1.000000
50%    1.000000
75%    2.000000
max    2.000000

In [32]:
import pandas as pd
import numpy as np
s1=pd.Series([1,3,6,np.nan,8])

#

In [33]:
s1

0    1.0
1    3.0
2    6.0
3    NaN
4    8.0
dtype: float64

In [34]:
Df=pd.DataFrame(np.random.randn(8,90))

In [35]:
Df

,0,1,2,3,4,5,6,7,8,9,...,80,81,82,83,84,85,86,87,88,89
0,0.415625,-0.808515,0.174668,-1.733166,-1.282821,0.594774,0.713163,-0.271748,-0.656531,-0.082538,...,1.454498,-0.916692,-0.329554,-0.092052,2.107085,0.052961,1.615437,0.731379,1.185772,-0.629315
1,-0.287568,-0.241112,-0.292905,0.451520,1.776039,-0.257316,0.638881,-1.187705,-1.780635,-1.643599,...,-2.575247,-0.493325,-0.931250,0.792461,0.179671,-1.135944,0.429504,1.004934,1.437711,-1.229241
2,0.736324,-0.364282,0.098666,0.644828,-1.260460,0.201850,-0.709039,-0.321649,0.179373,0.322712,...,0.689859,-0.182633,-1.037740,0.020319,-0.615780,-0.995039,0.433393,-1.604200,0.586195,-0.021054
3,0.033427,-2.530200,-1.076678,0.823804,0.130223,0.398571,-0.294786,-1.315602,-0.677035,-2.119707,...,-1.408788,-0.883275,-1.174691,-0.771502,0.667331,-1.519147,0.629548,-0.789827,0.032605,1.775147
4,0.742210,1.083950,-0.351745,0.623902,-0.600312,-1.130731,0.775528,1.092676,-0.982440,-0.493233,...,-0.194323,0.220638,-0.603764,0.054362,-1.256725,0.532774,-0.592971,-0.454789,0.707839,0.033151
5,-1.453214,-1.025083,-1.367423,1.740853,0.431285,-0.945954,2.026147,-0.103259,2.291179,0.124988,...,1.060618,0.210334,1.309733,0.382583,0.232606,1.494623,-0.270487,-0.562098,-1.222086,0.764845
6,-0.368025,-0.255334,-0.461226,1.159179,-0.214349,-1.339666,0.570136,-0.020834,-1.111492,0.095405,...,0.294783,-2.138557,-1.128788,0.463776,-0.160773,-0.660751,1.688133,0.282261,1.406672,1.535531
7,-1.709079,-0.222737,0.438799,0.855873,0.754099,0.104966,-0.762223,0.857452,0.288354,0.478212,...,0.843384,1.198449,1.606261,0.961608,-0.215815,0.137207,-0.935551,1.142964,-0.226265,1.150087

In [36]:
Df[8]

0   -0.656531
1   -1.780635
2    0.179373
3   -0.677035
4   -0.982440
5    2.291179
6   -1.111492
7    0.288354
Name: 8, dtype: float64